; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-5-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-2 - location
	p0-5 - location
	p1-0 - location
	p1-4 - location
	p1-5 - location
	p2-6 - location
	p4-5 - location
	p5-3 - location
	p6-0 - location
	p6-1 - location
	p6-2 - location
	p6-5 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s6)
	(at driver4 s4)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s5)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s1)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s5)
	(at package2 s2)
	(at package3 s4)
	(at package4 s0)
	(at package5 s1)
	(at package6 s3)
	(at package7 s6)
	(at package8 s1)
	(at package9 s1)
	(at package10 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 57)
	(= (time-to-drive s1 s0) 57)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 76)
	(= (time-to-drive s4 s0) 76)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 1)
	(= (time-to-drive s6 s0) 1)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 76)
	(= (time-to-drive s3 s1) 76)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 19)
	(= (time-to-drive s5 s1) 19)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 96)
	(= (time-to-drive s6 s1) 96)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 12)
	(= (time-to-drive s6 s2) 12)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 89)
	(= (time-to-drive s2 s3) 89)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 24)
	(= (time-to-drive s5 s3) 24)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 10)
	(= (time-to-drive s2 s4) 10)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 37)
	(= (time-to-drive s3 s4) 37)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 45)
	(= (time-to-drive s5 s4) 45)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 88)
	(= (time-to-drive s3 s6) 88)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 26)
	(= (time-to-drive s5 s6) 26)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s0)
	(at truck1 s1)
	(at truck5 s2)
	(at package1 s6)
	(at package2 s0)
	(at package3 s0)
	(at package4 s6)
	(at package5 s3)
	(at package6 s0)
	(at package8 s6)
	(at package9 s2)
	(at package10 s4)
	))

(:metric minimize (+ (* 3 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver4 s4 p1-4)
   deleted: (at driver4 s4)
   added: (at driver4 p1-4)
   goals met: 1 of 12
2. (walk driver4 p1-4 s1)
   deleted: (at driver4 p1-4)
   added: (at driver4 s1)
   goals met: 1 of 12
3. (board-truck driver4 truck5 s1)
   deleted: (at driver4 s1) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 1 of 12
4. (load-truck package5 truck5 s1)
   deleted: (at package5 s1)
   added: (in package5 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 1 of 12
5. (load-truck package8 truck5 s1)
   deleted: (at package8 s1)
   added: (in package8 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 1 of 12
6. (load-truck package9 truck5 s1)
   deleted: (at package9 s1)
   added: (in package9 truck5)
   changed: (load truck5) from 2 to 3, (fuel-per-minute truck5) from 13 to 16
   goals met: 1 of 12
7. (drive-truck truck5 s1 s0 driver4)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   changed: (fuel-used) from 0 to 912
   goals met: 1 of 12
8. (drive-truck truck5 s0 s4 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   changed: (fuel-used) from 912 to 2128
   goals met: 1 of 12
9. (load-truck package3 truck5 s4)
   deleted: (at package3 s4)
   added: (in package3 truck5)
   changed: (load truck5) from 3 to 4, (fuel-per-minute truck5) from 16 to 20
   goals met: 1 of 12
10. (drive-truck truck5 s4 s0 driver4)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   changed: (fuel-used) from 2128 to 3648
   goals met: 1 of 12
11. (load-truck package4 truck5 s0)
   deleted: (at package4 s0)
   added: (in package4 truck5)
   changed: (load truck5) from 4 to 5, (fuel-per-minute truck5) from 20 to 25
   goals met: 1 of 12
12. (unload-truck package3 truck5 s0)
   deleted: (in package3 truck5)
   added: (at package3 s0)
   changed: (load truck5) from 5 to 4, (fuel-per-minute truck5) from 25 to 20
   goals met: 2 of 12
13. (drive-truck truck5 s0 s6 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   changed: (fuel-used) from 3648 to 3668
   goals met: 2 of 12
14. (unload-truck package4 truck5 s6)
   deleted: (in package4 truck5)
   added: (at package4 s6)
   changed: (load truck5) from 4 to 3, (fuel-per-minute truck5) from 20 to 16
   goals met: 3 of 12
15. (unload-truck package8 truck5 s6)
   deleted: (in package8 truck5)
   added: (at package8 s6)
   changed: (load truck5) from 3 to 2, (fuel-per-minute truck5) from 16 to 13
   goals met: 4 of 12
16. (drive-truck truck5 s6 s2 driver4)
   deleted: (at truck5 s6)
   added: (at truck5 s2)
   changed: (fuel-used) from 3668 to 3824
   goals met: 5 of 12
17. (unload-truck package9 truck5 s2)
   deleted: (in package9 truck5)
   added: (at package9 s2)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 6 of 12
18. (load-truck package2 truck5 s2)
   deleted: (at package2 s2)
   added: (in package2 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 6 of 12
19. (load-truck package10 truck5 s2)
   deleted: (at package10 s2)
   added: (in package10 truck5)
   changed: (load truck5) from 2 to 3, (fuel-per-minute truck5) from 13 to 16
   goals met: 6 of 12
20. (drive-truck truck5 s2 s3 driver4)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   changed: (fuel-used) from 3824 to 5248
   goals met: 5 of 12
21. (unload-truck package5 truck5 s3)
   deleted: (in package5 truck5)
   added: (at package5 s3)
   changed: (load truck5) from 3 to 2, (fuel-per-minute truck5) from 16 to 13
   goals met: 6 of 12
22. (load-truck package6 truck5 s3)
   deleted: (at package6 s3)
   added: (in package6 truck5)
   changed: (load truck5) from 2 to 3, (fuel-per-minute truck5) from 13 to 16
   goals met: 6 of 12
23. (drive-truck truck5 s3 s4 driver4)
   deleted: (at truck5 s3)
   added: (at truck5 s4)
   changed: (fuel-used) from 5248 to 5840
   goals met: 6 of 12
24. (unload-truck package10 truck5 s4)
   deleted: (in package10 truck5)
   added: (at package10 s4)
   changed: (load truck5) from 3 to 2, (fuel-per-minute truck5) from 16 to 13
   goals met: 7 of 12
25. (drive-truck truck5 s4 s5 driver4)
   deleted: (at truck5 s4)
   added: (at truck5 s5)
   changed: (fuel-used) from 5840 to 6425
   goals met: 7 of 12
26. (load-truck package1 truck5 s5)
   deleted: (at package1 s5)
   added: (in package1 truck5)
   changed: (load truck5) from 2 to 3, (fuel-per-minute truck5) from 13 to 16
   goals met: 7 of 12
27. (drive-truck truck5 s5 s6 driver4)
   deleted: (at truck5 s5)
   added: (at truck5 s6)
   changed: (fuel-used) from 6425 to 6841
   goals met: 7 of 12
28. (unload-truck package1 truck5 s6)
   deleted: (in package1 truck5)
   added: (at package1 s6)
   changed: (load truck5) from 3 to 2, (fuel-per-minute truck5) from 16 to 13
   goals met: 8 of 12
29. (drive-truck truck5 s6 s0 driver4)
   deleted: (at truck5 s6)
   added: (at truck5 s0)
   changed: (fuel-used) from 6841 to 6854
   goals met: 8 of 12
30. (unload-truck package2 truck5 s0)
   deleted: (in package2 truck5)
   added: (at package2 s0)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 9 of 12
31. (unload-truck package6 truck5 s0)
   deleted: (in package6 truck5)
   added: (at package6 s0)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 10 of 12
32. (disembark-truck driver4 truck5 s0)
   deleted: (driving driver4 truck5)
   added: (at driver4 s0) (empty truck5)
   goals met: 10 of 12
33. (board-truck driver2 truck5 s0)
   deleted: (at driver2 s0) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 9 of 12
34. (drive-truck truck5 s0 s6 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   changed: (fuel-used) from 6854 to 6864
   goals met: 9 of 12
35. (drive-truck truck5 s6 s2 driver2)
   deleted: (at truck5 s6)
   added: (at truck5 s2)
   changed: (fuel-used) from 6864 to 6984
   goals met: 10 of 12
36. (disembark-truck driver2 truck5 s2)
   deleted: (driving driver2 truck5)
   added: (at driver2 s2) (empty truck5)
   goals met: 10 of 12
37. (walk driver2 s2 p0-2)
   deleted: (at driver2 s2)
   added: (at driver2 p0-2)
   goals met: 10 of 12
38. (walk driver2 p0-2 s0)
   deleted: (at driver2 p0-2)
   added: (at driver2 s0)
   goals met: 11 of 12
39. (board-truck driver4 truck2 s0)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 11 of 12
40. (drive-truck truck2 s0 s6 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 6984 to 6994
   goals met: 11 of 12
41. (drive-truck truck2 s6 s3 driver4)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   changed: (fuel-used) from 6994 to 7874
   goals met: 11 of 12
42. (disembark-truck driver4 truck2 s3)
   deleted: (driving driver4 truck2)
   added: (at driver4 s3) (empty truck2)
   goals met: 11 of 12
43. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 11 of 12
44. (drive-truck truck1 s3 s1 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 7874 to 8634
   goals met: 12 of 12
